
-- Лабораторна робота №1
    -- Студента групи КН-31 підгрупа 2
    -- Пагарського Олексія
    -- Варіант №7

    -- Мета: Ознайомитись з основами синтаксису мови haskell, 
    -- набути пратктичних навичок у роботі з типами даних та функціями

module Lab1 where   

    ----------------------------
    -- Task 1
    -- Наведiть приклади виразiв вказаного типу.
    -- Кожен список має мiстити кiлька елементiв.
    -- Перегляньте тип прикладiв, як їх визначає ghci. Прокоментуйте.
    
    -- (String, ([Bool], [Integer]))



    -- > :t ("Something", ([True, False], [1, 2, 3]))
    -- ("Something", ([True, False], [1, 2, 3]))
    -- :: Num a => ([Char], ([Bool], [a]))

    -- > :t ("Something"::String, ([True, False], [1, 2, 3]::[Integer]))
    -- ("Something"::String, ([True, False], [1, 2, 3]::[Integer]))
    -- :: (String, ([Bool], [Integer]))

    task1 s = (s :: String, ([True, False], [1, 2, 3]::[Integer]))

    -- для тестування виконання завдання необхідно виконати наступну команду:
    -- task1 "word"


    ----------------------------
    -- Task 2
    --- Функцiя приймає два числа i перевiряє, чи вони впорядкованi за зростанням.

    ord' :: Ord a => a -> a -> Bool
    ord' x y = x <= y

    -- > ord' 13 15
    -- True
    -- > ord' 13e13 15
    -- False
    -- > ord' 2.0 pi
    -- True


    -- Висновок:
    -- В результаті виконання лабораторної роботи було створено дві
    -- функції відповідно з заданим варіантом роботи. 
    -- Це дозволило закріпити знання та набути практичних навичок
    -- по розумінню синтаксису та створенню функцій
    -- функціональної мови програмування haskell.
